fancy_cars/app/controllers/cars_controller.rb

INSERT INTO "cars" ("make", "model", "year", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["make", "bob"], ["model", "jones"], ["year", 1292], ["price", 12.12], ["created_at", "2018-06-04 04:30:33.764373"], ["updated_at", "2018-06-04 04:30:33.764373"]]
---
  def create
    @car = Car.new(car_params)

    respond_to do |format|
      if @car.save

UPDATE "cars" SET "price" = ?, "updated_at" = ? WHERE "cars"."id" = ?  [["price", 5000.0], ["updated_at", "2018-06-04 04:27:53.901888"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @car.update(car_params)